УТ/src/Catalogs/CRM_ПотенциальныеКлиенты/CRM_ПотенциальныеКлиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПотенциальныеКлиенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <comment>Идентификатор в системе идентификации по лицу</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.CRM_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Отрасль</name>
    <type>
      <types>CatalogRef.CRM_Отрасли</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сфпПрефиксНабора</name>
      <type>
        <types>CatalogRef.сфпПрефиксыИсходящихВызовов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТехподдержкаЛогинПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сфпПрефиксНабора</name>
      <type>
        <types>CatalogRef.сфпПрефиксыИсходящихВызовов</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/CommonForms/CRM_ФормаНайденныхДублейПК/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Параметры.Свойство("СтруктураПоиска") Тогда
		
		ДублиНайдены = НайтиДубли(Параметры.СтруктураОбъекта, Параметры.СтруктураПоиска);
		
		Если ДублиНайдены Тогда
			ВеткаКорень = ДеревоПоиска.ПолучитьЭлементы();
			ВеткаКорень.Очистить();
			НоваяСтрока					= ВеткаКорень.Добавить();
			НоваяСтрока.Представление	= НСтр("ru='Создать потенциального клиента';en='Create: Customer / Contact'");
			НоваяСтрока.Объект			= Справочники.CRM_ПотенциальныеКлиенты.ПустаяСсылка();
			
			Для Каждого СтрокаНайденого Из _ТаблицаНайдено Цикл
				
				Строка				= ВеткаКорень.Добавить();				
				Строка.Объект			= СтрокаНайденого.Объект;
				Строка.Код				= СтрокаНайденого.Код;
				Строка.ОтветственныйМенеджер = СтрокаНайденого.ОтветственныйМенеджер;
				Строка.Представление	= СтрокаНайденого.Представление;
				Строка.ПометкаУдаления = СтрокаНайденого.Объект.ПометкаУдаления;
				
			КонецЦикла;			
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПравоДоступа("Добавление", Метаданные.Справочники.CRM_ПотенциальныеКлиенты) Тогда
		Элементы.ПродолжитьВводНового.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(ВладелецФормы.ВладелецФормы) = Тип("ПолеФормы") Тогда
		Элементы.ПерейтиКНайденному.Заголовок = НСтр("ru = 'Использовать найденного клиента'");
	КонецЕсли;
	
	Если НЕ ДублиНайдены Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПродолжитьВводНового", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПродолжитьВводНового(Команда)
	
	Если ЭтоВводНового Тогда
	
	ТД	= Элементы.ДеревоПоиска.ТекущиеДанные;
	
		Если ТД = Неопределено Или НЕ ЗначениеЗаполнено(ТД.Объект) Тогда
			Закрыть(Новый Структура("Результат,Объект", "Продолжить", Неопределено));
		Иначе
			Закрыть(Новый Структура("Результат,Объект", "Продолжить", ТД.Объект));
		КонецЕсли;	
	
	Иначе
		ПерейтиКНайденному(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВводНового()
	
	Закрыть(Новый Структура("Результат", "Продолжить"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНайденному(Команда)
	
	ТД	= Элементы.ДеревоПоиска.ТекущиеДанные;
	Если НЕ ТД = Неопределено Тогда
		Закрыть(Новый Структура("Результат,Объект", "Перейти", ТД.Объект));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере 
Функция НайтиДубли(СтруктураОбъекта, СтруктураПоиска)
	
	МассивНайденных = НайтиДублиПК(СтруктураОбъекта, СтруктураПоиска);
	
	Если МассивНайденных.Количество() = 0 Тогда
		ЕстьНайденные = Ложь;
	Иначе	
		ЕстьНайденные = Истина;
		Для Каждого СтрокаМассива Из МассивНайденных Цикл
			Отбор = Новый Структура();
			Отбор.Вставить("Объект", СтрокаМассива.Ссылка);
			НайдСтрока = _ТаблицаНайдено.НайтиСтроки(Отбор);
			Если НайдСтрока.Количество() = 0 Тогда
				Строка = _ТаблицаНайдено.Добавить();
				Строка.Объект			= СтрокаМассива.Ссылка;
				Строка.Код				= СтрокаМассива.Ссылка.Код;
				Строка.Представление	= СтрокаМассива.Наименование;
				Строка.ОтветственныйМенеджер	= СтрокаМассива.ОсновнойМенеджер;
			КонецЕсли;
			Строка = ТаблицаРасшифровкаНайдено.Добавить();
			Строка.Объект = СтрокаМассива.Ссылка;
			Строка.ПредставлениеНайденоПо = СтрЗаменить(СтрокаМассива.ИмяРеквизита, "CRM_", "") + " - " 
				+ Строка(СтрокаМассива.Реквизит);
		КонецЦикла;
		_ТаблицаНайдено.Сортировать("Объект Возр");
	КонецЕсли;
	
	Возврат ЕстьНайденные;
	
КонецФункции

Функция НайтиДублиПК(СтруктураОбъекта, СтруктураПоиска)
	
	УстановитьПривилегированныйРежим(Истина);
	МассивНайденных	= Новый Массив;
	
	УсловияПоискаПоТочномуСовпадению = Новый Массив;
	УсловияПоискаПоЧастиСтроки = Новый Массив;
	
	Для Каждого КлючИЗначение Из СтруктураПоиска Цикл
		
		ИмяРеквизита		= КлючИЗначение.Ключ;
		НайденноеЗначение	= "";
		
		Если ТипЗнч(СтруктураОбъекта) = Тип("Структура") Тогда
			СтруктураОбъекта.Свойство(ИмяРеквизита, НайденноеЗначение);
		Иначе
			Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураОбъекта,
				 ИмяРеквизита) Тогда Продолжить; КонецЕсли;
			НайденноеЗначение = СтруктураОбъекта[ИмяРеквизита];
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НайденноеЗначение) Тогда
			
			Если СтрНайти(ИмяРеквизита, "CRM_") = 1 Тогда
				ИмяРеквизита	= СтрЗаменить(ИмяРеквизита, "CRM_", "");
			ИначеЕсли СтрНайти(ИмяРеквизита, "Контакт_") = 1 Тогда
				ИмяРеквизита	= СтрЗаменить(ИмяРеквизита, "Контакт_", "");
			Иначе
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(СтруктураОбъекта) = Тип("Структура") Тогда
				СтруктураОбъекта.Свойство(ИмяРеквизита, НайденноеЗначение);
			Иначе
				Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураОбъекта,
					 ИмяРеквизита) Тогда Продолжить; КонецЕсли;
				НайденноеЗначение = СтруктураОбъекта[ИмяРеквизита];
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НайденноеЗначение) Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		НовоеУсловие = Новый Структура();
		ПоляПоиска = Новый Массив();
		
		Если ИмяРеквизита = "Наименование" Тогда
			ПолеПоиска = Перечисления.CRM_ПоляПоискаКонтактов.Наименование;
		ИначеЕсли ИмяРеквизита = "Телефон" Тогда
			ПолеПоиска = Перечисления.CRM_ПоляПоискаКонтактов.Телефон;
		ИначеЕсли ИмяРеквизита = "АдресЭлектроннойПочты" Тогда
			ПолеПоиска = Перечисления.CRM_ПоляПоискаКонтактов.EMail;
		ИначеЕсли ИмяРеквизита = "Адрес" Тогда
			ПолеПоиска = Перечисления.CRM_ПоляПоискаКонтактов.Адрес;
		ИначеЕсли ИмяРеквизита = "Сайт" Тогда
			ПолеПоиска = Перечисления.CRM_ПоляПоискаКонтактов.Прочее;
		КонецЕсли;
		
		ПоляПоиска.Добавить(ПолеПоиска);
		НовоеУсловие = CRM_ПоискКонтактов.СтруктураУсловияПоиска(НайденноеЗначение);
		НовоеУсловие.Вставить("ПоляПоиска", ПоляПоиска);
		
		Если КлючИЗначение.Значение = ВРег("ПОДОБНО") Тогда
			УсловияПоискаПоЧастиСтроки.Добавить(НовоеУсловие);
		ИначеЕсли КлючИЗначение.Значение = "=" Тогда
			УсловияПоискаПоТочномуСовпадению.Добавить(НовоеУсловие);
		КонецЕсли;
		
	КонецЦикла;
	
	Если УсловияПоискаПоЧастиСтроки.Количество() > 0 Тогда
		
		МассивПК = CRM_ПоискКонтактов.ВыполнитьПоискКонтактов(УсловияПоискаПоЧастиСтроки, 1, , Истина);
		
		Если Не ЗначениеЗаполнено(МассивПК.КодОшибки) Тогда
			
			Для Каждого Строка Из МассивПК.ТаблицаРезультатов Цикл
				
				Если ТипЗнч(Строка.Владелец) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
					НовыйЭлемент = Новый Структура("ИмяРеквизита, Наименование, ОсновнойМенеджер, Реквизит, Ссылка",
					Строка(Строка.ПолеПоиска), Строка.Владелец.Наименование, Строка.Владелец.ОсновнойМенеджер, Строка.ЗначениеПоиска, Строка.Владелец);
					МассивНайденных.Добавить(НовыйЭлемент);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если УсловияПоискаПоТочномуСовпадению.Количество() > 0 Тогда
		
		МассивПК = CRM_ПоискКонтактов.ВыполнитьПоискКонтактов(УсловияПоискаПоТочномуСовпадению, 2, , Истина);
		
		Если Не ЗначениеЗаполнено(МассивПК.КодОшибки) Тогда
			
			Для Каждого Строка Из МассивПК.ТаблицаРезультатов Цикл
				
				Если ТипЗнч(Строка.Владелец) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
					НовыйЭлемент = Новый Структура("ИмяРеквизита, Наименование, ОсновнойМенеджер, Реквизит, Ссылка",
					Строка(Строка.ПолеПоиска), Строка.Владелец.Наименование, Строка.Владелец.ОсновнойМенеджер, Строка.ЗначениеПоиска, Строка.Владелец);
					МассивНайденных.Добавить(НовыйЭлемент);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивНайденных;
	
КонецФункции

 #Область РаботаСДеревомПоиска

&НаКлиенте
Процедура ДеревоПоискаПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ДеревоПоиска.ТекущиеДанные = Неопределено Тогда
		ТекОбъект = Неопределено;
	ИначеЕсли ТекОбъект = Элементы.ДеревоПоиска.ТекущиеДанные.Объект Тогда
		Возврат;
	Иначе
		ТекОбъект = Элементы.ДеревоПоиска.ТекущиеДанные.Объект;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ДеревоПоискаПриАктивизацииСтрокиОбработчик", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПоискаПриАктивизацииСтрокиОбработчик()
	
	ОтветственныйМенеджерКлиента = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
	Элементы.ОтветственныйМенеджерКлиента.Видимость	= Ложь;
	
	ЭтоВводНового = Ложь;
	Если Элементы.ДеревоПоиска.ТекущиеДанные = Неопределено Тогда
		
		Элементы.ПродолжитьВводНового.Заголовок 				= НСтр("ru='Продолжить ввод нового';en='Continue typing a new one'");
		Элементы.ПерейтиКНайденному.Доступность					= Ложь;
		Элементы.ТаблицаРасшифровкаНайдено.ОтборСтрок			= Новый ФиксированнаяСтруктура("Объект", Неопределено);
		ЭтоВводНового = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Элементы.ДеревоПоиска.ТекущиеДанные.Объект) Тогда
		
		Элементы.ПродолжитьВводНового.Заголовок					= НСтр("ru='Продолжить ввод нового';en='Continue typing a new one'");		
		Элементы.ПерейтиКНайденному.Доступность					= Ложь;
		Элементы.ТаблицаРасшифровкаНайдено.ОтборСтрок			= Новый ФиксированнаяСтруктура("Объект", ТекОбъект); 
		ЭтоВводНового = Истина;
		
	Иначе
		
		Элементы.ПродолжитьВводНового.Заголовок			= НСтр("ru='Выбрать текущего';en='Choose Customer'");
		
		ОтветственныйМенеджерКлиента					= Элементы.ДеревоПоиска.ТекущиеДанные.ОтветственныйМенеджер;
		Элементы.ОтветственныйМенеджерКлиента.Видимость	= Истина;
		Элементы.ТаблицаРасшифровкаНайдено.ОтборСтрок			= Новый ФиксированнаяСтруктура("Объект", ТекОбъект); 
		
	КонецЕсли;
	
	ИзменитьПодсказкуПродолжитьВводНового("");
	Элементы.ПродолжитьВводНового.Доступность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПодсказкуПродолжитьВводНового(Подсказка)
	
	Команда = Команды.Найти("ПродолжитьВводНового");
	
	Если Команда <> Неопределено Тогда
		Команда.Подсказка = Подсказка;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПоискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Объект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
